---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPairArray.Clear
source: html/02178031-710f-936d-9868-2e32baf867fe.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.Clear Method

Removes every VertexIndex pair from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```